# Books Core Assignment
Susan Shin

![png](Images/books.png)

In [40]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()

In [41]:
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from urllib.parse import quote_plus as urlquote

In [42]:
connection = f"mysql+pymysql://{'root'}:{urlquote('Iamnumber1now!')}@localhost/books"
engine = create_engine(connection)

In [43]:
database_exists(connection)

True

Load Authors

In [44]:
authors = pd.read_csv('data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [45]:
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [46]:
q = """SELECT * FROM authors;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

Load Users

In [47]:
users = pd.read_csv('data/users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [48]:
users.to_sql('users', engine, if_exists = 'replace')

3

In [49]:
u = """SELECT * FROM users;"""
pd.read_sql(u, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

Load Books

In [50]:
books = pd.read_csv('data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [51]:
books.to_sql('books', engine, if_exists = 'replace')

6

In [52]:
u = """SELECT * FROM books;"""
pd.read_sql(u, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

Load Favorites

In [53]:
favs = pd.read_csv('data/favorites.csv')
favs.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [54]:
favs.to_sql('favs', engine, if_exists = 'replace')

7

In [55]:
f = """SELECT * FROM favs;"""
pd.read_sql(f, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [56]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2            data
3            favs
4           users

In [62]:
j = """SELECT books.title, favs.user_id
FROM books
JOIN favs ON books.id = favs.book_id
WHERE favs.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(j, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1